mafeiGitHub/stm32Mp3/Bsp/cLcd.cpp
  DSI_IO_WriteCmd (0, (uint8_t*)ShortRegData15);
  DSI_IO_WriteCmd (0, (uint8_t*)ShortRegData27);

  DSI_IO_WriteCmd (0, (uint8_t*)ShortRegData28);
  DSI_IO_WriteCmd (2, (uint8_t *)lcdRegData6);

  /* GOAVSt*/
  DSI_IO_WriteCmd (0, (uint8_t*)ShortRegData2);
  DSI_IO_WriteCmd (6, (uint8_t*)lcdRegData7);

  DSI_IO_WriteCmd (0, (uint8_t*)ShortRegData29);
  DSI_IO_WriteCmd (14, (uint8_t*)lcdRegData8);

  DSI_IO_WriteCmd (0, (uint8_t*)ShortRegData30);
  DSI_IO_WriteCmd (14, (uint8_t*)lcdRegData9);

  DSI_IO_WriteCmd (0, (uint8_t*)ShortRegData31);
  DSI_IO_WriteCmd (10, (uint8_t*)lcdRegData10);

  DSI_IO_WriteCmd (0, (uint8_t*)ShortRegData32);
  DSI_IO_WriteCmd (0, (uint8_t*)ShortRegData46);

  DSI_IO_WriteCmd (0, (uint8_t*)ShortRegData2);
  DSI_IO_WriteCmd (10, (uint8_t*)lcdRegData11);

  DSI_IO_WriteCmd (0, (uint8_t*)ShortRegData33);
  DSI_IO_WriteCmd (15, (uint8_t*)lcdRegData12);

  DSI_IO_WriteCmd (0, (uint8_t*)ShortRegData29);
  DSI_IO_WriteCmd (15, (uint8_t*)lcdRegData13);

  DSI_IO_WriteCmd (0, (uint8_t*)ShortRegData30);
  DSI_IO_WriteCmd (10, (uint8_t*)lcdRegData14);

  DSI_IO_WriteCmd (0, (uint8_t*)ShortRegData31);
  DSI_IO_WriteCmd (15, (uint8_t*)lcdRegData15);

  DSI_IO_WriteCmd (0, (uint8_t*)ShortRegData32);
  DSI_IO_WriteCmd (15, (uint8_t*)lcdRegData16);

  DSI_IO_WriteCmd (0, (uint8_t*)ShortRegData34);
  DSI_IO_WriteCmd (10, (uint8_t*)lcdRegData17);

  DSI_IO_WriteCmd (0, (uint8_t*)ShortRegData35);
  DSI_IO_WriteCmd (10, (uint8_t*)lcdRegData18);

  DSI_IO_WriteCmd (0, (uint8_t*)ShortRegData2);
  DSI_IO_WriteCmd (10, (uint8_t*)lcdRegData19);

  DSI_IO_WriteCmd (0, (uint8_t*)ShortRegData33);
  DSI_IO_WriteCmd (15, (uint8_t*)lcdRegData20);

  DSI_IO_WriteCmd (0, (uint8_t*)ShortRegData29);
  DSI_IO_WriteCmd (15, (uint8_t*)lcdRegData21);

  DSI_IO_WriteCmd (0, (uint8_t*)ShortRegData30);
  DSI_IO_WriteCmd (10, (uint8_t*)lcdRegData22);

  DSI_IO_WriteCmd (0, (uint8_t*)ShortRegData31);
  DSI_IO_WriteCmd (15, (uint8_t*)lcdRegData23);

  DSI_IO_WriteCmd (0, (uint8_t*)ShortRegData32);
  DSI_IO_WriteCmd (15, (uint8_t*)lcdRegData24);

  /* PWR_CTRL1 - 0xc580h - 130th parameter - default 0x00 */
  /* Pump 1 min and max DM                                */
  DSI_IO_WriteCmd (0, (uint8_t*)ShortRegData13);
  DSI_IO_WriteCmd (0, (uint8_t*)ShortRegData47);
  DSI_IO_WriteCmd (0, (uint8_t*)ShortRegData48);
  DSI_IO_WriteCmd (0, (uint8_t*)ShortRegData49);

  /* Exit CMD2 mode */
  DSI_IO_WriteCmd (0, (uint8_t*)ShortRegData1);
  DSI_IO_WriteCmd (3, (uint8_t*)lcdRegData25);

  // Standard DCS Initialization TO KEEP CAN BE DONE IN HSDT                   */

  /* NOP - goes back to DCS std command ? */
  DSI_IO_WriteCmd (0, (uint8_t*)ShortRegData1);

  /* Gamma correction 2.2+ table (HSDT possible) */
  DSI_IO_WriteCmd (0, (uint8_t*)ShortRegData1);
  DSI_IO_WriteCmd (16, (uint8_t*)lcdRegData3);

  /* Gamma correction 2.2- table (HSDT possible) */
  DSI_IO_WriteCmd (0, (uint8_t*)ShortRegData1);
  DSI_IO_WriteCmd (16, (uint8_t*)lcdRegData4);

  /* Send Sleep Out command to display : no parameter */
  DSI_IO_WriteCmd (0, (uint8_t*)ShortRegData36);

  /* Wait for sleep out exit*/
  HAL_Delay (120);

  switch (ColorCoding) {
    case OTM8009A_FORMAT_RBG565 : /* Set Pixel color format to RGB565 */
      DSI_IO_WriteCmd (0, (uint8_t*)ShortRegData37);
      break;
    case OTM8009A_FORMAT_RGB888 : /* Set Pixel color format to RGB888 */
      DSI_IO_WriteCmd (0, (uint8_t*)ShortRegData38);
      break;
    default :
      break;
    }

  // Send command to configure display in landscape orientation mode. By default the orientation mode is portrait
  if (orientation == OTM8009A_ORIENTATION_LANDSCAPE) {
    DSI_IO_WriteCmd (0, (uint8_t*)ShortRegData39);
    DSI_IO_WriteCmd (4, (uint8_t*)lcdRegData27);
    DSI_IO_WriteCmd (4, (uint8_t*)lcdRegData28);
    }

  // CABC : Content Adaptive Backlight Control section start
  DSI_IO_WriteCmd (0, (uint8_t*)ShortRegData40); // defaut is 0 (lowest Brightness), 0xFF is highest Brightness, try 0x7F : intermediate value
  DSI_IO_WriteCmd (0, (uint8_t*)ShortRegData41); // defaut is 0, try 0x2C - Brightness Control Block, Display Dimming & BackLight on
  DSI_IO_WriteCmd (0, (uint8_t*)ShortRegData42); // defaut is 0, try 0x02 - image Content based Adaptive Brightness [Still Picture]
  DSI_IO_WriteCmd (0, (uint8_t*)ShortRegData43); // defaut is 0 (lowest Brightness), 0xFF is highest Brightness

  /* Send Command Display On */
  DSI_IO_WriteCmd (0, (uint8_t*)ShortRegData44);

  /* NOP command */
  DSI_IO_WriteCmd (0, (uint8_t*)ShortRegData1);

  /* Send Command GRAM memory write (no parameters) : this initiates frame write via other DSI commands sent by */
  /* DSI host from LTDC incoming pixels in video mode */
  DSI_IO_WriteCmd (0, (uint8_t*)ShortRegData45);
  }
//}}}
#endif

// cLcd
//{{{
cLcd::cLcd (uint32_t buffer0, uint32_t buffer1)  {

  mBuffer[false] = buffer0;
  mBuffer[true] = buffer1;

  updateNumDrawLines();
  }
//}}}
cLcd::~cLcd() {}

// static members
//{{{
cLcd* cLcd::create (std::string title) {

  if (!mLcd) {
    mLcd = new cLcd (SDRAM_FRAME0, SDRAM_FRAME1);
    mLcd->init (title);
    }

  return mLcd;
  }
//}}}
//{{{
std::string cLcd::hex (int value, uint8_t width) {

  std::ostringstream os;
  if (width)
    os << std::hex << std::setfill ('0') << std::setw (width) << value;
  else
    os << std::hex << value;
  return os.str();
  }
//}}}
//{{{
std::string cLcd::dec (int value, uint8_t width, char fill) {

  std::ostringstream os;
  if (width)
    os << std::setfill (fill) << std::setw (width) << value;
  else
    os << value;
  return os.str();
  }
//}}}

// public members
//{{{
void cLcd::setTitle (std::string title) {
  mTitle = title;
  updateNumDrawLines();
  }
//}}}
//{{{
void cLcd::setShowDebug (bool title, bool info, bool lcdStats, bool footer) {

  mShowTitle = title;
  mShowInfo = info;
  mShowLcdStats = lcdStats;
  mShowFooter = footer;

  updateNumDrawLines();
  }
//}}}

//{{{
void cLcd::info (uint32_t colour, std::string str, bool newLine) {

  bool tailing = mLastLine == (int)mFirstLine + mNumDrawLines - 1;

  auto line = (newLine && (mLastLine < mMaxLine-1)) ? mLastLine+1 : mLastLine;
  mLines[line].mTime = osKernelSysTick();
  mLines[line].mColour = colour;
  mLines[line].mString = str;
  if (newLine)
    mLastLine = line;

