mafeiGitHub/stm32Mp3/Bsp/cLcd.cpp
    // The following values are same for portrait and landscape orientations
    uint32_t VSA = OTM8009A_480X800_VSYNC; // 12  - Vertical start active time in units of lines
    uint32_t VBP = OTM8009A_480X800_VBP;   // 12  - Vertical Back Porch time in units of lines
    uint32_t VFP = OTM8009A_480X800_VFP;   // 12  - Vertical Front Porch time in units of lines
    uint32_t HSA = OTM8009A_480X800_HSYNC; // 63  - Horizontal start active time in units of lcdClk
    uint32_t HBP = OTM8009A_480X800_HBP;   // 120 - Horizontal Back Porch time in units of lcdClk
    uint32_t HFP = OTM8009A_480X800_HFP;   // 120 - Horizontal Front Porch time in units of lcdClk

    uint32_t LcdClock  = 27429; /*!< LcdClk = 27429 kHz */

    hdsivideo_handle.ColorCoding          = LCD_DSI_PIXEL_DATA_FMT_RBG888;
    hdsivideo_handle.VSPolarity           = DSI_VSYNC_ACTIVE_HIGH;
    hdsivideo_handle.HSPolarity           = DSI_HSYNC_ACTIVE_HIGH;
    hdsivideo_handle.DEPolarity           = DSI_DATA_ENABLE_ACTIVE_HIGH;
    hdsivideo_handle.Mode                 = DSI_VID_MODE_BURST; /* Mode Video burst ie : one LgP per line */
    hdsivideo_handle.NullPacketSize       = 0xFFF;
    hdsivideo_handle.NumberOfChunks       = 0;
    hdsivideo_handle.PacketSize           = HACT; /* Value depending on display orientation choice portrait/landscape */
    hdsivideo_handle.HorizontalSyncActive = (HSA * laneByteClk_kHz) / LcdClock;
    hdsivideo_handle.HorizontalBackPorch  = (HBP * laneByteClk_kHz) / LcdClock;
    hdsivideo_handle.HorizontalLine       = ((HACT + HSA + HBP + HFP) * laneByteClk_kHz)/LcdClock; /* Value depending on display orientation choice portrait/landscape */
    hdsivideo_handle.VerticalSyncActive   = VSA;
    hdsivideo_handle.VerticalBackPorch    = VBP;
    hdsivideo_handle.VerticalFrontPorch   = VFP;
    hdsivideo_handle.VerticalActive       = VACT; /* Value depending on display orientation choice portrait/landscape */
    hdsivideo_handle.LPCommandEnable      = DSI_LP_COMMAND_ENABLE; // Enable sending LP command while streaming active in video mode */
    hdsivideo_handle.LPLargestPacketSize  = 16; // Largest packet size possible to transmit in LP mode in VSA, VBP, VFP regions
    hdsivideo_handle.LPVACTLargestPacketSize = 0;  // Largest packet size possible to transmit in LP mode in HFP region during VACT period
    hdsivideo_handle.LPHorizontalFrontPorchEnable = DSI_LP_HFP_ENABLE;    /* Allow sending LP commands during HFP period */
    hdsivideo_handle.LPHorizontalBackPorchEnable  = DSI_LP_HBP_ENABLE;    /* Allow sending LP commands during HBP period */
    hdsivideo_handle.LPVerticalActiveEnable       = DSI_LP_VACT_ENABLE;   /* Allow sending LP commands during VACT period */
    hdsivideo_handle.LPVerticalFrontPorchEnable   = DSI_LP_VFP_ENABLE;    /* Allow sending LP commands during VFP period */
    hdsivideo_handle.LPVerticalBackPorchEnable    = DSI_LP_VBP_ENABLE;    /* Allow sending LP commands during VBP period */
    hdsivideo_handle.LPVerticalSyncActiveEnable    = DSI_LP_VSYNC_ENABLE; /* Allow sending LP commands during VSync = VSA period */
    HAL_DSI_ConfigVideoMode (&hdsi_discovery, &hdsivideo_handle);
    //}}}
    //{{{  configurte LTDC clock
    // Note: The following values should not be changed as the PLLSAI is also used to clock the USB FS
    // PLLSAI_VCO Input = HSE_VALUE/PLL_M = 1 Mhz
    // PLLSAI_VCO Output = PLLSAI_VCO Input * PLLSAIN = 384 Mhz
    // PLLLCDCLK = PLLSAI_VCO Output/PLLSAIR = 384 MHz / 7 = 54.85 MHz
    // LTDC clock frequency = PLLLCDCLK / LTDC_PLLSAI_DIVR_2 = 54.85 MHz / 2 = 27.429 MHz
    RCC_PeriphCLKInitTypeDef PeriphClkInitStruct;
    PeriphClkInitStruct.PeriphClockSelection = RCC_PERIPHCLK_LTDC;
    PeriphClkInitStruct.PLLSAI.PLLSAIN = 384;
    PeriphClkInitStruct.PLLSAI.PLLSAIR = 7;
    PeriphClkInitStruct.PLLSAIDivR = RCC_PLLSAIDIVR_2;
    HAL_RCCEx_PeriphCLKConfig (&PeriphClkInitStruct);
    //}}}
    //{{{  LTDC timing Configuration
    hLtdc.Init.HorizontalSync = (HSA - 1);
    hLtdc.Init.AccumulatedHBP = (HSA + HBP - 1);
    hLtdc.Init.AccumulatedActiveW = (getWidth() + HSA + HBP - 1);
    hLtdc.Init.TotalWidth = (getWidth() + HSA + HBP + HFP - 1);
    hLtdc.LayerCfg->ImageWidth  = getWidth();
    hLtdc.LayerCfg->ImageHeight = getHeight();

    // LTDC background value
    hLtdc.Init.Backcolor.Blue = 0;
    hLtdc.Init.Backcolor.Green = 0;
    hLtdc.Init.Backcolor.Red = 0;
    hLtdc.Init.PCPolarity = LTDC_PCPOLARITY_IPC;
    //}}}
    HAL_LTDC_StructInitFromVideoConfig (&(hLtdc), &(hdsivideo_handle));
    HAL_LTDC_Init (&hLtdc);
    HAL_DSI_Start (&hdsi_discovery);
    OTM8009A_Init (OTM8009A_FORMAT_RGB888, LCD_ORIENTATION_LANDSCAPE);
  #endif

  layerInit (0, frameBufferAddress);
  setFrameBufferAddress[1] = frameBufferAddress;
  showFrameBufferAddress[1] = frameBufferAddress;
  showAlpha[1] = 0;

  //  LTDC IRQ init
  osSemaphoreDef (ltdcSem);
  ltdc.sem = osSemaphoreCreate (osSemaphore (ltdcSem), -1);

  ltdc.timeouts = 0;
  ltdc.lineIrq = 0;
  ltdc.fifoUnderunIrq = 0;
  ltdc.transferErrorIrq = 0;
  ltdc.lastTicks = 0;
  ltdc.lineTicks = 0;
  ltdc.frameWait = 0;

  HAL_NVIC_SetPriority (LTDC_IRQn, 0xE, 0);
  HAL_NVIC_EnableIRQ (LTDC_IRQn);

  // set line interupt line number
  LTDC->LIPCR = 0;

  // enable line interrupt
  LTDC->IER |= LTDC_IT_LI;
  }
//}}}
//{{{
void cLcd::layerInit (uint8_t layer, uint32_t frameBufferAddress) {

  LTDC_LayerCfgTypeDef* curLayerCfg = &hLtdc.LayerCfg[layer];

  curLayerCfg->WindowX0 = 0;
  curLayerCfg->WindowX1 = getWidth();
  curLayerCfg->WindowY0 = 0;
  curLayerCfg->WindowY1 = getHeight();

  curLayerCfg->PixelFormat = LTDC_PIXEL_FORMAT_ARGB8888;
  curLayerCfg->FBStartAdress = (uint32_t)frameBufferAddress;

  curLayerCfg->Alpha = 255;
  curLayerCfg->Alpha0 = 0;

  curLayerCfg->Backcolor.Blue = 0;
  curLayerCfg->Backcolor.Green = 0;
  curLayerCfg->Backcolor.Red = 0;

  curLayerCfg->BlendingFactor1 = LTDC_BLENDING_FACTOR1_PAxCA;
  curLayerCfg->BlendingFactor2 = LTDC_BLENDING_FACTOR2_PAxCA;

  curLayerCfg->ImageWidth = getWidth();
  curLayerCfg->ImageHeight = getHeight();

